redakker/esp8266-firmware-mqtt/webserver.cpp
          content += "   <form action=\"/\" method=\"get\" class=\"form-horizontal\" role=\"form\">\r\n";
          content += "    <h2>Configuration Form</h2>\r\n";
          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"device\" class=\"col-sm-3 control-label\">Device Name</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input name=\"device\" type=\"text\" id=\"device\" placeholder=\"Device Name\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("device", false);
          content += "\" autofocus>\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";
          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"room\" class=\"col-sm-3 control-label\">Room Name</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input name=\"room\" type=\"text\" id=\"room\" placeholder=\"Room Name\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("room", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += " </div>\r\n";

          content += "    <hr />\r\n";
          content += "    <h2>Network configuration</h2>\r\n";

          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"ssid\" class=\"col-sm-3 control-label\">SSID</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input name=\"ssid\" type=\"text\" id=\"ssid\" placeholder=\"wireless SSID\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("ssid", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";

          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"wifipasswd\" class=\"col-sm-3 control-label\">WIFI password</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input name=\"wifipasswd\" type=\"password\" id=\"wifipasswd\" placeholder=\"wireless password\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("wifipasswd", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";

          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"mqttbroker\" class=\"col-sm-3 control-label\">MQTT broker</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input name=\"mqttbroker\" type=\"text\" id=\"mqttbroker\" placeholder=\"MQTT broker address\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("mqttbroker", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";

          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"mqttuser\" class=\"col-sm-3 control-label\">MQTT user</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input name=\"mqttuser\" type=\"text\" id=\"mqttuser\" placeholder=\"MQTT broker user\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("mqttuser", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";

          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"mqttpw\" class=\"col-sm-3 control-label\">MQTT password</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input name=\"mqttpw\" type=\"password\" id=\"mqttpw\" placeholder=\"MQTT broker password\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("mqttpw", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";

          content += "    <hr />\r\n";
          content += "    <h2>Pin configuration</h2>\r\n";
          content += "    <span class=\"help-block\">pin of the devices (-1 means that device is not available in this device)</span>\r\n";

          content += "    <div class=\"form-group form-inline\">\r\n";
          content += "      <label for=\"button\" class=\"col-sm-3 control-label\">Button</label>\r\n";
          content += "      <div class=\"col-sm-3\">\r\n";
          content += "        <input name=\"button\" type=\"text\" id=\"button\" placeholder=\"pin of the button\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("button", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "      <label for=\"btype\" class=\"col-sm-3 control-label\">Button type</label>\r\n";
          content += "      <div class=\"col-sm-3\">\r\n";
          content += "        <select  name=\"btype\" id=\"btype\" class=\"form-control\">\r\n";
          content += "          <option>stateful</option>\r\n";
          content += "          <option ";
          content += eepromhandler->getValueAsString("btype", false) == "stateless" ? "selected=\"selected\"" : "";
          content += ">stateless</option>\r\n";
          content += "        </select>\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";

          content += "    <div class=\"form-group form-inline\">\r\n";
          content += "      <label for=\"trigger\" class=\"col-sm-3 control-label\">Distance trigger</label>\r\n";
          content += "      <div class=\"col-sm-3\">\r\n";
          content += "        <input name=\"trigger\" type=\"text\" id=\"trigger\" placeholder=\"pin of the trigger\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("trigger", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "      <label for=\"echo\" class=\"col-sm-3 control-label\">Distance echo</label>\r\n";
          content += "      <div class=\"col-sm-3\">\r\n";
          content += "        <input name=\"echo\" type=\"text\" id=\"echo\" placeholder=\"pin of the echo\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("echo", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";

          content += "    <div class=\"form-group form-inline\">\r\n";
          content += "      <label for=\"sda\" class=\"col-sm-3 control-label\">Display SDA</label>\r\n";
          content += "      <div class=\"col-sm-3\">\r\n";
          content += "        <input name=\"sda\" type=\"text\" id=\"sda\" placeholder=\"pin of the display sda\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("sda", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "      <label for=\"sdc\" class=\"col-sm-3 control-label\">Display SDC/SCL</label>\r\n";
          content += "      <div class=\"col-sm-3\">\r\n";
          content += "        <input name=\"sdc\" type=\"text\" id=\"sdc\" placeholder=\"pin of the display sdc/scl\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("sdc", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";

          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"relay\" class=\"col-sm-3 control-label\">Relay</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input name=\"relay\" type=\"text\" id=\"relay\" placeholder=\"pin of the relay\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("relay", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += " </div>\r\n";

          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"dht22\" class=\"col-sm-3 control-label\">DHT 22</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input name=\"dht22\" type=\"text\" id=\"dht22\" placeholder=\"pin of the DHT 22\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("dht22", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";

          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"led\" class=\"col-sm-3 control-label\">Led</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input  name=\"led\" type=\"text\" id=\"led\" placeholder=\"pin of the led\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("led", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";

          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"motion\" class=\"col-sm-3 control-label\">Motion sensor</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input  name=\"motion\" type=\"text\" id=\"motion\" placeholder=\"pin of the motion sensor\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("motion", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";

          content += "    <div class=\"form-group form-inline\">\r\n";
          content += "      <label for=\"button\" class=\"col-sm-3 control-label\">Led number on strip</label>\r\n";
          content += "      <div class=\"col-sm-3\">\r\n";
          content += "        <input name=\"lednum\" type=\"text\" id=\"lednum\" placeholder=\"led number on led strip (WS2812B)\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("lednum", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "      <label for=\"btype\" class=\"col-sm-3 control-label\">Led strip data pin</label>\r\n";
          content += "      <div class=\"col-sm-3\">\r\n";
          content += "        <select  name=\"ledpin\" id=\"ledpin\" class=\"form-control\">\r\n";
          content += "          <option value=\"\">None</option>\r\n";
          content += "          <option value=\"4\" ";
          content += eepromhandler->getValueAsString("ledpin", false) == "4" ? "selected=\"selected\"" : "";
          content += "          >4</option>\r\n";
          content += "          <option value=\"5\" ";
          content += eepromhandler->getValueAsString("ledpin", false) == "5" ? "selected=\"selected\"" : "";
          content += "          >5</option>\r\n";
          content += "        </select>\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";


          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"resistname\" class=\"col-sm-3 control-label\">Resist name</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input  name=\"resistname\" type=\"text\" id=\"resistname\" placeholder=\"name of the resist\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("resistname", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";

          content += "    <div class=\"form-group form-inline\">\r\n";
          content += "      <label for=\"text\" class=\"col-sm-3 control-label\">Resist</label>\r\n";
          content += "      <div class=\"col-sm-3\">\r\n";
          content += "        <input  name=\"resist\" type=\"text\" id=\"text\" placeholder=\"pin of the water or moisture sensor\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("resist", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "      <label for=\"rtype\" class=\"col-sm-3 control-label\">Resist type</label>\r\n";
          content += "      <div class=\"col-sm-3\">\r\n";
          content += "        <select  name=\"rtype\" id=\"rtype\" class=\"form-control\">\r\n";
          content += "          <option>analog</option>\r\n";
          content += "          <option ";
          content += eepromhandler->getValueAsString("rtype", false) == "digital" ? "selected=\"selected\"" : "";
          content += ">digital</option>\r\n";
          content += "        </select>\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";



          content += "    <hr />\r\n";
          content += "    <h2>Time configuration</h2>\r\n";
          content += "    <div class=\"form-group\">\r\n";
          content += "      <label for=\"text\" class=\"col-sm-3 control-label\">Data send interval (ms)</label>\r\n";
          content += "      <div class=\"col-sm-9\">\r\n";
          content += "        <input name=\"interval\" type=\"text\" id=\"text\" placeholder=\"send interval\" class=\"form-control\" value=\"";
          content += eepromhandler->getValueAsString("interval", false);
          content += "\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";
          content += "    <hr />\r\n";
          content += "    <div class=\"form-group\">\r\n";
          content += "      <div class=\"col-sm-9 col-sm-offset-3\">\r\n";
          content += "        <button type=\"submit\" class=\"btn btn-primary btn-block\">Submit</button>\r\n";
          content += "        <input type=\"hidden\" name=\"action\" value=\"updatesettings\">\r\n";
          content += "      </div>\r\n";
          content += "    </div>\r\n";
          content += "  </form> <!-- /form -->\r\n";
          content += " </div> <!-- ./container -->\r\n";
          content += " </body>\r\n";
          content += " </html>\r\n";
          server->send(200, "text/html", content);

          // Restart after update settings to reload objects
          if (action == "updatesettings") {
            //eepromhandler->restart();
          }
        });
      }

