redakker/esp8266-firmware-mqtt/webserver.cpp
      server->on("/info", [ = ]() {

        String roomInfo = eepromhandler->getValueAsString("room", true);
        String deviceInfo = eepromhandler->getValueAsString("device", true);

        String commandIn = "/home/device/" + roomInfo + "/" + deviceInfo + "/in/";
        String commandOut = "/home/device/" + roomInfo + "/" + deviceInfo + "/";

        content =  "<!DOCTYPE HTML><html>\r\n";
        content += " <head>\r\n";
        content += " <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" />\r\n";
        content += " <meta name=\"viewport\" content=\"width=device-width, initial-scale=1\" />\r\n";
        content += " <link rel=\"stylesheet\" href=\"http://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css\">\r\n";
        content += " </head>\r\n";
        content += " <body>\r\n";
        content += " <div class=\"container\">\r\n";
        content += "  <div class=\"row\">\r\n";
        content += "    <div class=\"col-lg-12 col-centered\">\r\n";
        content += "      <h2>MQTT info</h2>\r\n";
        content += "      <br/>\r\n";
        content += "        ";

        content += "        <h3>Topic out:</h3>\r\n";
        content += "        <div style=\"margin-left: 20px;\"><strong>" + commandOut + "</strong></div>\r\n";
        content += "        <hr/>\r\n";
        
        content += "        <h3>Led strip color topic</h3>   \r\n";
        content += "          <div style=\"margin-left: 20px;\">Change color topic: <strong>" + commandIn + "color</strong></div>\r\n";
        content += "          <div style=\"margin-left: 20px;\">Payload: <strong>HEX or RGB color code</strong></div>\r\n";
        content += "          <div style=\"margin-left: 20px;\">Example: <strong>#FFFF00</strong> or <strong>235,56,88</strong></div>\r\n";
        content += "        <hr/>\r\n";

        content += "        <h3>Led strip brightness topic</h3>   \r\n";
        content += "          <div style=\"margin-left: 20px;\">Change brightness: <strong>" + commandIn + "brightness</strong></div>\r\n";
        content += "          <div style=\"margin-left: 20px;\">Payload: <strong>number 0-255</strong></div>\r\n";
        content += "          <div style=\"margin-left: 20px;\">Example: <strong>130</strong></div>\r\n";
        content += "        <hr/>\r\n";

        content += "        <h3>Led strip breathe topic</h3>   \r\n";
        content += "          <div style=\"margin-left: 20px;\">Change brightness: <strong>" + commandIn + "breathe</strong></div>\r\n";
        content += "          <div style=\"margin-left: 20px;\">Payload: <strong>number 0-10</strong></div>\r\n";
        content += "          <div style=\"margin-left: 20px;\">This is working just in case of static color.</div>\r\n";
        content += "        <hr/>\r\n";

        content += "        <h3>Led strip demo mode</h3>   \r\n";
        content += "          <div style=\"margin-left: 20px;\">Change brightness: <strong>" + commandIn + "color</strong></div>\r\n";
        content += "          <div style=\"margin-left: 20px;\">Payload: <strong>demo01 - demo06</strong></div>\r\n";
        content += "          <div style=\"margin-left: 20px;\">Animated color modes 1-6</div>\r\n";
        content += "        <hr/>\r\n";

        content += "        <h3>Relay topic</h3>   \r\n";
        content += "          <div style=\"margin-left: 20px;\">Change relay state: <strong>" + commandIn + "relay</strong></div>\r\n";
        content += "          <div style=\"margin-left: 20px;\">Payload: <strong>1 or 0 (on/off)</strong></div>\r\n";
        content += "        <hr/>\r\n";

        content += "        <h3>Oled display topic</h3>   \r\n";
        content += "          <div style=\"margin-left: 20px;\">Add text topic: <strong>" + commandIn + "text</strong></div>\r\n";
        content += "          <div style=\"margin-left: 20px;\">Payload: <strong>Text message</strong></div>\r\n";
        content += "          <div style=\"margin-left: 20px;\">Example: <strong>Hello world!</strong></div>\r\n";
        content += "        <hr/>\r\n";
        
        content += "      <br/>\r\n";
        content += "      <a href=\"/\">return</a>\r\n";
        content += "    </div>\r\n";
        content += "   </div>\r\n";
        content += " </div>\r\n";
        content += " </body>\r\n";
        content += " </html>\r\n";
        server->send(200, "text/html", content);
      });
    }
};
